Repository: ArthurVicl/VanGO
Catalog: lib/l10n/app_*.arb
Languages: fr, pt

# settingsTitle
source: Settings
fr: Paramètres
pt: Configurações

source: Dark theme
fr: Thème sombre
pt: Tema escuro

source: App language
fr: Langue de l'application
pt: Idioma do aplicativo

# languagePortuguese
source: Portuguese
fr: Portugais
pt: Português

# languageEnglish
source: English
fr: Anglais
pt: Inglês

# languageFrench
source: French
fr: Français
pt: Francês

# navMap
source: Map
fr: Carte
pt: Mapa

# navSearch
source: Search
fr: Rechercher
pt: Procurar

# navProfile
source: Profile
fr: Profil
pt: Perfil

# alunoMapTitle
source: Student Map
fr: Carte de l'étudiant
pt: Mapa do Aluno

# chatMotoristaTitle
source: Chat with Driver
fr: Discussion avec le chauffeur
pt: Chat com Motorista

# procurarMotoristaTitle
source: Find Driver
fr: Trouver un chauffeur
pt: Procurar Motorista

# meuPerfilTitle
source: My Profile
fr: Mon profil
pt: Meu Perfil

# welcomeTitle
source: Welcome to VanGo!
fr: Bienvenue sur VanGo !
pt: Bem-vindo ao VanGo!

# welcomeSubtitle
source: Your easy transport solution.
fr: Votre solution de transport facile.
pt: Sua solução de transporte fácil.

# motoristaCardTitle
source: DRIVER
fr: CHAUFFEUR
pt: MOTORISTA

# motoristaCardDesc
source: Manage your routes and students.
fr: Gérez vos trajets et vos étudiants.
pt: Gerencie suas rotas e alunos.

# alunoCardTitle
source: STUDENT
fr: ÉTUDIANT
pt: ALUNO

# alunoCardDesc
source: Track your van and chat with the driver.
fr: Suivez votre van et discutez avec le chauffeur.
pt: Acompanhe sua van e converse com o motorista.

# alreadyHaveAccount
source: Already have an account?
fr: Vous avez déjà un compte ?
pt: Já tem uma conta?

# loginLink
source: Log in
fr: Connectez-vous
pt: Faça Login

# aboutApp
source: About the App
fr: À propos de l'app
pt: Sobre o App

# loginTitle
source: Login
fr: Connexion

# emailHint
source: Your email
fr: Votre e-mail
pt: Seu e-mail

# passwordHint
source: Your password
fr: Votre mot de passe
pt: Sua senha

source: Forgot password?
fr: Mot de passe oublié ?
pt: Esqueceu a senha?

# enterButton
source: ENTER
fr: ENTRER
pt: ENTRAR

# noAccount
source: Don’t have an account?
fr: Vous n'avez pas de compte ?
pt: Não tem uma conta?

# signupLink
source: Sign up
fr: Inscrivez-vous
pt: Cadastre-se

# errorUnknownRole
source: Could not determine user type.
fr: Impossible de déterminer le type d'utilisateur.
pt: Não foi possível determinar o tipo de usuário.

# errorUserDataMissing
source: User data not found.
fr: Données utilisateur introuvables.
pt: Dados do usuário não encontrados.

# authErrorFallback
source: An authentication error occurred.
fr: Une erreur d'authentification est survenue.
pt: Ocorreu um erro de autenticação.

# unexpectedError
source: An unexpected error occurred: {error}
fr: Une erreur imprévue s'est produite : {error}
pt: Ocorreu um erro inesperado: {error}

source: Loading routes...
fr: Chargement des trajets...
pt: Carregando rotas...

# noRoutesLinked
source: No routes linked at the moment.
fr: Aucun trajet lié pour le moment.
pt: Sem rotas vinculadas no momento.

# routeLabel
source: Route: {nome}
fr: Trajet : {nome}
pt: Rota: {nome}

# stopLabel
source: Stop {index}
fr: Arrêt {index}
pt: Parada {index}

# searchNameHint
source: Search by name...
fr: Rechercher par nom...
pt: Buscar por nome...

source: Loading colleges...
fr: Chargement des établissements...
pt: Carregando faculdades...

source: Filter by college
fr: Filtrer par établissement
pt: Filtrar por faculdade

source: All colleges
fr: Tous les établissements
pt: Todas as faculdades

# noColleges
source: No colleges registered. Create routes to unlock filters.
fr: Aucun établissement enregistré. Créez des trajets pour activer les filtres.
pt: Nenhuma faculdade cadastrada. Cadastre rotas para liberar filtros.

source: No drivers found.
fr: Aucun chauffeur trouvé.
pt: Nenhum motorista encontrado.

# currentDriverTitle
source: Your current driver
fr: Votre chauffeur actuel
pt: Seu motorista atual

# ratingLabel
source: Rating: {nota} ★
fr: Note : {nota} ★
pt: Avaliação: {nota} ★

# loginToSearch
source: Log in to search for drivers.
fr: Connectez-vous pour chercher des chauffeurs.
pt: Faça login para procurar motoristas.

# loginButton
source: Log in
fr: Connexion
pt: Fazer Login

# logoutError
source: Error while signing out: {erro}
fr: Erreur lors de la déconnexion : {erro}
pt: Erro ao sair: {erro}

# avaliacoesTitle
source: Reviews
fr: Avis
pt: Avaliações

# errorLoadingRatings
source: Error loading reviews: {erro}
fr: Erreur lors du chargement des avis : {erro}
pt: Erro ao carregar avaliações: {erro}

# noRatings
source: No reviews recorded for this driver.
fr: Aucun avis enregistré pour ce chauffeur.
pt: Nenhuma avaliação registrada para este motorista.

# studentLabel
source: Student: {id}
fr: Étudiant : {id}
pt: Aluno: {id}

# studentUnknown
source: Student not identified
fr: Étudiant non identifié
pt: Aluno não identificado

# chatInquiryDriver
source: Chatting with a student not yet linked. Only link when you want to add them to your route.
fr: Vous discutez avec un étudiant non encore lié. Liez uniquement si vous souhaitez l'ajouter à votre trajet.
pt: Conversando com um aluno ainda não vinculado. Use o vínculo apenas quando desejar adicioná-lo à sua rota.

# chatInquiryStudent
source: You are not linked to this driver yet, but you can chat normally.
fr: Vous n'êtes pas encore lié à ce chauffeur, mais vous pouvez discuter normalement.
pt: Você ainda não está vinculado a este motorista, mas pode conversar normalmente.

# chatHint
source: Type a message...
fr: Écrire un message...
pt: Digite uma mensagem...

# functionsMissing
source: Server function not found. Check your Cloud Functions deployment.
fr: Fonction serveur introuvable. Vérifiez le déploiement des Cloud Functions.
pt: Função do servidor não encontrada. Verifique a configuração das Cloud Functions.

# unlinkSuccess
source: Unlinked successfully.
fr: Déliaison effectuée avec succès.
pt: Desvinculado com sucesso.

# unlinkError
source: Error unlinking: {erro}
fr: Erreur lors de la déliaison : {erro}
pt: Erro ao desvincular: {erro}

source: Destination (cache)
pt: Destino (cache)
